{
  "about": {
    "intro": "Hi! I am Kavyansh Garg",
    "bio": "I am an aspiring Cyber Security Analyst and a Computer Application student, holding a Google Cyber Security Certificate. My core passion lies in solving complex, 'mind-boggling' problems, which led me from programming in Python and Bash to the intricate world of digital defense.I am particularly fascinated by the intersection of cybersecurity and artificial intelligence—exploring how AI can be leveraged for proactive threat detection and automated incident response, as well as understanding the unique challenges of securing AI systems themselves. With a strong foundation in security principles, hands-on programming skills, and a relentless curiosity, I am seeking a remote internship where I can contribute to a forward-thinking team and apply my analytical abilities to the evolving challenges of the AI-driven security landscape.",
    "profiles": [
      {"label": "Github", "url": "https://github.com/krishpyyy-pt"},
      {"label": "LinkedIN", "url": "https://www.linkedin.com/in/kavyansh-g-71ab9a363/"}
    ]
  },

  "projects": [
    {
      "name": "Lino(The AI Gatekeeper)",
      "description": "Engineered 'Lino,' a proof-of-concept, next-generation security gateway designed to protect web applications and servers. The system intercepts incoming requests, leveraging the Gemini AI API to perform real-time content analysis and block potential threats based on scan results. Future development is focused on creating a custom-trained model using public cybersecurity data for more advanced, proactive threat detection.",
      "technologies": ["Python", "Gemini AI API", "Flask", "Data Analysis"],
      "link": "--" 
    },
    {
      "name": "My retro Win95 style Website",
      "description": "Designed and developed this fully interactive portfolio from scratch to create a unique and memorable user experience, styled after the Windows 95 operating system. The desktop environment is built with vanilla JavaScript, HTML, and CSS, featuring a multi-window interface, draggable and resizable windows, and dynamically loaded content from a central JSON file.",
      "technologies": ["HTML", "CSS", "JavaScript", "JSON"],
      "link": "--" 
    }
  ],

  "certificates": [
    {
      "title": "Google cybersecurity Certificate",
      "organisation": "Google and Coursera",
      "date": "August 2025",
      "image": "assets/images/certs/Google(port_ver).png" 
    },
    {
      "title": "Ethical Hacking with AI",
      "organisation": "IIT madras and Internshala",
      "date": "July 2025",
      "image": "assets/images/certs/internshala(port_ver.).png"
    },
    {
      "title": "Career Advancment Bootcamp",
      "organisation": "Medha",
      "date": "August 2025",
      "image": "assets/images/certs/medha(port_ver.).png"
    }
  ],

  "contact": {
    "email": "kavyanshgarg27@gmail.com",
    "socials": [
      {"label": "LinkedIN", "url": "https://www.linkedin.com/in/kavyansh-g-71ab9a363/"},
      {"label": "Github", "url": "https://github.com/krishpyyy-pt"}
    ]
  }
}
